

class OutputMessage:
    
    opening_greeting = (    "👋 Привет!\n"
    "Я ваш помощник по поиску работы!\n\n"
    "Я здесь, чтобы помочь вам находить\n"
    "актуальные вакансии на HH.ru.\n\n"
    "Просто дайте мне знать, что именно вы ищете, и я соберу для вас всю необходимую информацию!\n\n"
    "🔍 Вот что я могу сделать:\n"
    "  • Искать вакансии по ключевым \n\t\t\t\tсловам и местоположению.\n\n"
    "  • Предоставлять информацию о \n\t\t\t\tкомпаниях и их вакансиях.\n\n"
    "  • Находить вакансии по их \n\t\t\t\tрасположению, типу занятости \n\t\t\t\tи опыту работы.\n\n"
    "  • Помогать с анализом рынка труда.\n\n"
    "💬 Как начать? Просто напишите мне, что вы ищете!\n\n"
    "Например:\n"
    "  • \"Вакансии разработчика в Москве\"\n"
    "  • \"Работа в маркетинге на HH.ru\"\n\n"
    "Я готов помочь вам в поиске вашей идеальной работы! 🚀")
    
    main_menu = ''
    
    return_to_main_menu = f'Вы возвращены в главное меню, выберите команду\n\n {main_menu}'
    authorization_mess = 'Чтобы получать вакансии войдите или зарегистрируйтесь'