

class OutputMessage:
    
    opening_greeting = ('👋 Привет!\n Я ваш помощник по поиску работы!\n\n'
                        'Я здесь, чтобы помочь вам находить\n актуальные вакансии на HH.ru\n\n'
                        'Просто дайте мне знать, что именно вы ищете, и я соберу для вас всю необходимую информацию!\n\n'
                        '🔍 Вот что я могу сделать:\n\n'
                        '\t\t\t\t\t\tИскать вакансии по ключевым словам\n\t\t\t\t\t и местоположению.\n\n'
                        '\t\t\t\t\t\tПредоставлять информацию о компаниях\n\t\t\t\t\t и их вакансиях.\n\n'
                        '\t\t\t\t\t\tНаходить вакансии по их расположению,\n\t\t\t\t\t типу занятости и опыту работы.\n\n'
                        '\t\t\t\t\t\tПомогать с анализом рынка труда.\n\n'
                        '💬 Как начать? Просто напишите мне, что вы ищете!\n\n Например:\n\n'
                        '"Вакансии разработчика в Москве"\n\n'
                        '"Работа в маркетинге на HH.ru"\n\n'
                        'Я готов помочь вам в поиске вашей идеальной работы! 🚀')
    
    main_menu = ''
    
    return_to_main_menu = f'Вы возвращены в главное меню, выберите команду\n\n {main_menu}'
    authorization_mess = 'Чтобы получать вакансии войдите или зарегистрируйтесь'